myrottenpotatoes /app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Potato 2"], ["rating", "G"], ["description", nil], ["release_date", "2023-11-17 00:00:00"], ["created_at", "2023-11-17 21:19:24.672389"], ["updated_at", "2023-11-17 21:19:24.672389"]]
---
  def create
    begin
      @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars 2"], ["updated_at", "2023-11-15 16:10:29.523665"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    if @movie.update(movie_params)